--------------------------------------------------------------------------
      name:  __000000
       log:  C:\Users\wb255520\Documents\myados\wbopendata\run\wbopendata_
> v14_test.log
  log type:  text
 opened on:   8 Jan 2019, 22:41:52

. cd "C:\Users\wb255520\OneDrive - WBG\000.general\02.ado_files_\14.wbopen
> data\versions\v14"
C:\Users\wb255520\OneDrive - WBG\000.general\02.ado_files_\14.wbopendata\v
> ersions\v14

. set checksum off, perm
(set checksum preference recorded)

. 
. *** wbopendata, country(chn - China) clear
. 
. set trace off

. 
. wbopendata, country(chn - China) clear

. des

Contains data
  obs:         1,600                          
 vars:            65                          
 size:     1,212,800                          
--------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------
countryname     str80   %80s                  Country Name
countrycode     str5    %9s                   Country Code
iso2code        str2    %9s                   Country Code (ISO 2 digits)
region          str39   %39s                  Region
regioncode      str3    %9s                   Region Code
indicatorname   str140  %140s                 Indicator Name
indicatorcode   str25   %25s                  Indicator Code
yr1960          double  %10.0g                1960
yr1961          double  %10.0g                1961
yr1962          double  %10.0g                1962
yr1963          double  %10.0g                1963
yr1964          double  %10.0g                1964
yr1965          double  %10.0g                1965
yr1966          double  %10.0g                1966
yr1967          double  %10.0g                1967
yr1968          double  %10.0g                1968
yr1969          double  %10.0g                1969
yr1970          double  %10.0g                1970
yr1971          double  %10.0g                1971
yr1972          double  %10.0g                1972
yr1973          double  %10.0g                1973
yr1974          double  %10.0g                1974
yr1975          double  %10.0g                1975
yr1976          double  %10.0g                1976
yr1977          double  %10.0g                1977
yr1978          double  %10.0g                1978
yr1979          double  %10.0g                1979
yr1980          double  %10.0g                1980
yr1981          double  %10.0g                1981
yr1982          double  %10.0g                1982
yr1983          double  %10.0g                1983
yr1984          double  %10.0g                1984
yr1985          double  %10.0g                1985
yr1986          double  %10.0g                1986
yr1987          double  %10.0g                1987
yr1988          double  %10.0g                1988
yr1989          double  %10.0g                1989
yr1990          double  %10.0g                1990
yr1991          double  %10.0g                1991
yr1992          double  %10.0g                1992
yr1993          double  %10.0g                1993
yr1994          double  %10.0g                1994
yr1995          double  %10.0g                1995
yr1996          double  %10.0g                1996
yr1997          double  %10.0g                1997
yr1998          double  %10.0g                1998
yr1999          double  %10.0g                1999
yr2000          double  %10.0g                2000
yr2001          double  %10.0g                2001
yr2002          double  %10.0g                2002
yr2003          double  %10.0g                2003
yr2004          double  %10.0g                2004
yr2005          double  %10.0g                2005
yr2006          double  %10.0g                2006
yr2007          double  %10.0g                2007
yr2008          double  %10.0g                2008
yr2009          double  %10.0g                2009
yr2010          double  %10.0g                2010
yr2011          double  %10.0g                2011
yr2012          double  %10.0g                2012
yr2013          double  %10.0g                2013
yr2014          double  %10.0g                2014
yr2015          double  %10.0g                2015
yr2016          double  %10.0g                2016
yr2017          double  %10.0g                2017
--------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. wbopendata2, country(chn - China) clear

. des

Contains data
  obs:         1,600                          
 vars:            65                          
 size:     1,212,800                          
--------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------
countryname     str80   %80s                  Country Name
countrycode     str5    %9s                   Country Code
iso2code        str2    %9s                   Country Code (ISO 2 digits)
region          str39   %39s                  Region
regioncode      str3    %9s                   Region Code
indicatorname   str140  %140s                 Indicator Name
indicatorcode   str25   %25s                  Indicator Code
yr1960          double  %10.0g                1960
yr1961          double  %10.0g                1961
yr1962          double  %10.0g                1962
yr1963          double  %10.0g                1963
yr1964          double  %10.0g                1964
yr1965          double  %10.0g                1965
yr1966          double  %10.0g                1966
yr1967          double  %10.0g                1967
yr1968          double  %10.0g                1968
yr1969          double  %10.0g                1969
yr1970          double  %10.0g                1970
yr1971          double  %10.0g                1971
yr1972          double  %10.0g                1972
yr1973          double  %10.0g                1973
yr1974          double  %10.0g                1974
yr1975          double  %10.0g                1975
yr1976          double  %10.0g                1976
yr1977          double  %10.0g                1977
yr1978          double  %10.0g                1978
yr1979          double  %10.0g                1979
yr1980          double  %10.0g                1980
yr1981          double  %10.0g                1981
yr1982          double  %10.0g                1982
yr1983          double  %10.0g                1983
yr1984          double  %10.0g                1984
yr1985          double  %10.0g                1985
yr1986          double  %10.0g                1986
yr1987          double  %10.0g                1987
yr1988          double  %10.0g                1988
yr1989          double  %10.0g                1989
yr1990          double  %10.0g                1990
yr1991          double  %10.0g                1991
yr1992          double  %10.0g                1992
yr1993          double  %10.0g                1993
yr1994          double  %10.0g                1994
yr1995          double  %10.0g                1995
yr1996          double  %10.0g                1996
yr1997          double  %10.0g                1997
yr1998          double  %10.0g                1998
yr1999          double  %10.0g                1999
yr2000          double  %10.0g                2000
yr2001          double  %10.0g                2001
yr2002          double  %10.0g                2002
yr2003          double  %10.0g                2003
yr2004          double  %10.0g                2004
yr2005          double  %10.0g                2005
yr2006          double  %10.0g                2006
yr2007          double  %10.0g                2007
yr2008          double  %10.0g                2008
yr2009          double  %10.0g                2009
yr2010          double  %10.0g                2010
yr2011          double  %10.0g                2011
yr2012          double  %10.0g                2012
yr2013          double  %10.0g                2013
yr2014          double  %10.0g                2014
yr2015          double  %10.0g                2015
yr2016          double  %10.0g                2016
yr2017          double  %10.0g                2017
--------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. wbopendata2, country(chn - China) clear testserver

. des

Contains data
  obs:         1,600                          
 vars:            65                          
 size:     1,089,600                          
--------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------
countryname     str5    %9s                   Country Name
countrycode     str3    %9s                   Country Code
iso2code        str2    %9s                   Country Code (ISO 2 digits)
region          str39   %39s                  Region
regioncode      str3    %9s                   Region Code
indicatorname   str140  %140s                 Indicator Name
indicatorcode   str25   %25s                  Indicator Code
yr1960          double  %10.0g                1960
yr1961          double  %10.0g                1961
yr1962          double  %10.0g                1962
yr1963          double  %10.0g                1963
yr1964          double  %10.0g                1964
yr1965          double  %10.0g                1965
yr1966          double  %10.0g                1966
yr1967          double  %10.0g                1967
yr1968          double  %10.0g                1968
yr1969          double  %10.0g                1969
yr1970          double  %10.0g                1970
yr1971          double  %10.0g                1971
yr1972          double  %10.0g                1972
yr1973          double  %10.0g                1973
yr1974          double  %10.0g                1974
yr1975          double  %10.0g                1975
yr1976          double  %10.0g                1976
yr1977          double  %10.0g                1977
yr1978          double  %10.0g                1978
yr1979          double  %10.0g                1979
yr1980          double  %10.0g                1980
yr1981          double  %10.0g                1981
yr1982          double  %10.0g                1982
yr1983          double  %10.0g                1983
yr1984          double  %10.0g                1984
yr1985          double  %10.0g                1985
yr1986          double  %10.0g                1986
yr1987          double  %10.0g                1987
yr1988          double  %10.0g                1988
yr1989          double  %10.0g                1989
yr1990          double  %10.0g                1990
yr1991          double  %10.0g                1991
yr1992          double  %10.0g                1992
yr1993          double  %10.0g                1993
yr1994          double  %10.0g                1994
yr1995          double  %10.0g                1995
yr1996          double  %10.0g                1996
yr1997          double  %10.0g                1997
yr1998          double  %10.0g                1998
yr1999          double  %10.0g                1999
yr2000          double  %10.0g                2000
yr2001          double  %10.0g                2001
yr2002          double  %10.0g                2002
yr2003          double  %10.0g                2003
yr2004          double  %10.0g                2004
yr2005          double  %10.0g                2005
yr2006          double  %10.0g                2006
yr2007          double  %10.0g                2007
yr2008          double  %10.0g                2008
yr2009          double  %10.0g                2009
yr2010          double  %10.0g                2010
yr2011          double  %10.0g                2011
yr2012          double  %10.0g                2012
yr2013          double  %10.0g                2013
yr2014          double  %10.0g                2014
yr2015          double  %10.0g                2015
yr2016          double  %10.0g                2016
yr2017          double  %10.0g                2017
--------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. set trace on

. set tracedepth 3

. 
. 
. set trace off

. local ctry chi 

. 
. wbopendata2, country(`ctry') clear

. codebook indicatorcode

--------------------------------------------------------------------------
indicatorcode                                               Indicator Code
--------------------------------------------------------------------------

                  type:  string (str25)

         unique values:  1,600                    missing "":  0/1,600

              examples:  "DT.NTR.PRVT.CD"
                         "IP.TMK.RSCT"
                         "SE.PRM.TCHR"
                         "SL.MNF.0714.MA.ZS"

. 
. wbopendata2, country(`ctry') clear testserver

. codebook indicatorcode

--------------------------------------------------------------------------
indicatorcode                                               Indicator Code
--------------------------------------------------------------------------

                  type:  string (str25)

         unique values:  1,600                    missing "":  0/1,600

              examples:  "DT.NTR.PRVT.CD"
                         "IP.TMK.RSCT"
                         "SE.PRM.TCHR"
                         "SL.MNF.0714.MA.ZS"

. 
. 
. *** wbopendata, language(en - English) topics(2 - Aid Effectiveness) cle
> ar
. 
. set trace off

. 
. wbopendata2, language(en - English) topics(2 - Aid Effectiveness) clear

. codebook indicatorcode

--------------------------------------------------------------------------
indicatorcode                                               Indicator Code
--------------------------------------------------------------------------

                  type:  string (str17)

         unique values:  72                       missing "":  0/19,008

              examples:  "DC.DAC.GBRL.CD"
                         "DC.DAC.SVNL.CD"
                         "DT.NFL.UNFP.CD"
                         "DT.ODA.ODAT.MP.ZS"

. 
. wbopendata2, language(en - English) topics(2 - Aid Effectiveness) clear 
> testserver

. codebook indicatorcode

--------------------------------------------------------------------------
indicatorcode                                               Indicator Code
--------------------------------------------------------------------------

                  type:  string (str17)

         unique values:  72                       missing "":  0/19,008

              examples:  "DC.DAC.GBRL.CD"
                         "DC.DAC.SVNL.CD"
                         "DT.NFL.UNFP.CD"
                         "DT.ODA.ODAT.MP.ZS"

. 
. 
. *** wbopendata, language(en - English) indicator(ag.agr.trac.no - Agricu
> ltural machinery, tractors) clear
. 
. set trace off

. 
. wbopendata2, language(en - English) indicator(ag.agr.trac.no - Agricultu
> ral machinery, tractors) clear nometadata

. codebook indicatorcode

--------------------------------------------------------------------------
indicatorcode                                               Indicator Code
--------------------------------------------------------------------------

                  type:  string (str14)

         unique values:  1                        missing "":  0/264

            tabulation:  Freq.  Value
                           264  "ag.agr.trac.no"

. 
. wbopendata2, language(en - English) indicator(ag.agr.trac.no - Agricultu
> ral machinery, tractors) clear testserver nometadata

. codebook indicatorcode

--------------------------------------------------------------------------
indicatorcode                                               Indicator Code
--------------------------------------------------------------------------

                  type:  string (str14)

         unique values:  1                        missing "":  0/264

            tabulation:  Freq.  Value
                           264  "AG.AGR.TRAC.NO"

. 
. *** wbopendata, language(en - English) indicator(ag.agr.trac.no - Agricu
> ltural machinery, tractors) clear
. 
. set trace off

. 
. wbopendata2, language(en - English) indicator(ag.agr.trac.no - Agricultu
> ral machinery, tractors) long clear



Metadata: ag.agr.trac.no

--------------------------------------------------------------------------
    
    Name: Agricultural machinery, tractors
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Agricultural machinery refers to the number of wheel
    and crawler tractors (excluding garden tractors) in use in
    agriculture at the end of the calendar year specified or during the
    first quarter of the following year.
 
 -------------------------------------------------------------------------
    
    Source Organization: Food and Agriculture Organization, electronic
    files and web site.
 
 -------------------------------------------------------------------------
    
      
    Topics: Agriculture & Rural Development
 
 -------------------------------------------------------------------------



. 
. wbopendata2, language(en - English) indicator(ag.agr.trac.no - Agricultu
> ral machinery, tractors) long clear testserver



Metadata: ag.agr.trac.no

--------------------------------------------------------------------------
    
    Name: Agricultural machinery, tractors
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Agricultural machinery refers to the number of wheel
    and crawler tractors (excluding garden tractors) in use in
    agriculture at the end of the calendar year specified or during the
    first quarter of the following year.
 
 -------------------------------------------------------------------------
    
    Source Organization: Food and Agriculture Organization, electronic
    files and web site.
 
 -------------------------------------------------------------------------
    
      
    Topics: Agriculture & Rural Development
 
 -------------------------------------------------------------------------



. 
. *** wbopendata, country(ago;bdi;chi;dnk;esp) indicator(sp.pop.0610.fe.un
> ) clear
. 
. set trace off

. 
. wbopendata2, country(ago;bdi;chi;dnk;esp) indicator(sp.pop.0610.fe.un) c
> lear



Metadata: sp.pop.0610.fe.un

--------------------------------------------------------------------------
    
    Name: Population, ages 6-10, female
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: Education Statistics
 
 -------------------------------------------------------------------------
    
    Source Note: Population, ages 6-10, female is the total number of
    females age 6-10.
 
 -------------------------------------------------------------------------
    
    Source Organization: UNESCO Institute for Statistics (Derived)
 
 -------------------------------------------------------------------------
    
      
    Topics: Education
 
 -------------------------------------------------------------------------



. tab countrycode

    Country |
       Code |      Freq.     Percent        Cum.
------------+-----------------------------------
        AGO |          1       20.00       20.00
        BDI |          1       20.00       40.00
        CHI |          1       20.00       60.00
        DNK |          1       20.00       80.00
        ESP |          1       20.00      100.00
------------+-----------------------------------
      Total |          5      100.00

. 
. wbopendata2, country(ago;bdi;chi;dnk;esp) indicator(sp.pop.0610.fe.un) c
> lear testserver



Metadata: sp.pop.0610.fe.un

--------------------------------------------------------------------------
    
    Name: Population, ages 6-10, female
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: Education Statistics
 
 -------------------------------------------------------------------------
    
    Source Note: Population, ages 6-10, female is the total number of
    females age 6-10.
 
 -------------------------------------------------------------------------
    
    Source Organization: UNESCO Institute for Statistics (Derived)
 
 -------------------------------------------------------------------------
    
      
    Topics: Education
 
 -------------------------------------------------------------------------



. tab countrycode

    Country |
       Code |      Freq.     Percent        Cum.
------------+-----------------------------------
        AGO |          1       20.00       20.00
        BDI |          1       20.00       40.00
        CHI |          1       20.00       60.00
        DNK |          1       20.00       80.00
        ESP |          1       20.00      100.00
------------+-----------------------------------
      Total |          5      100.00

. 
. **** wbopendata, indicator(si.pov.dday; ny.gdp.pcap.pp.kd) clear long
. 
. set trace off

.                 
. wbopendata2, indicator(si.pov.dday; ny.gdp.pcap.pp.kd) clear long



Metadata: si.pov.dday

--------------------------------------------------------------------------
    
    Name: Poverty headcount ratio at $1.90 a day (2011 PPP) (% of
    population)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Poverty headcount ratio at $1.90 a day is the
    percentage of the population living on less than $1.90 a day at 2011
    international prices. As a result of revisions in PPP exchange
    rates, poverty rates for individual countries cannot be compared
    with poverty rates reported in earlier editions.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, Development Research Group. Data
    are based on primary household survey data obtained from government
    statistical agencies and World Bank country departments. Data for
    high-income economies are from the Luxembourg Income Study database.
    For more information and methodology, please see PovcalNet
    (http://iresearch.worldbank.org/PovcalNet/index.htm"}"}).
 
 -------------------------------------------------------------------------
    
      
    Topics: Poverty
 
 -------------------------------------------------------------------------
      
    Topics: Aid Effectiveness
 
 -------------------------------------------------------------------------
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------





Metadata: ny.gdp.pcap.pp.kd

--------------------------------------------------------------------------
    
    Name: GDP per capita, PPP (constant 2011 international $)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: GDP per capita based on purchasing power parity
    (PPP"}). PPP GDP is gross domestic product converted to
    international dollars using purchasing power parity rates. An
    international dollar has the same purchasing power over GDP as the
    U.S. dollar has in the United States. GDP at purchaser's prices is
    the sum of gross value added by all resident producers in the
    economy plus any product taxes and minus any subsidies not included
    in the value of the products. It is calculated without making
    deductions for depreciation of fabricated assets or for depletion
    and degradation of natural resources. Data are in constant 2011
    international dollars.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, International Comparison Program
    database.
 
 -------------------------------------------------------------------------
    
      
    Topics: Economy & Growth
 
 -------------------------------------------------------------------------



.  
. wbopendata2, indicator(si.pov.dday; ny.gdp.pcap.pp.kd) clear long testse
> rver



Metadata: si.pov.dday

--------------------------------------------------------------------------
    
    Name: Poverty headcount ratio at $1.90 a day (2011 PPP) (% of
    population)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Poverty headcount ratio at $1.90 a day is the
    percentage of the population living on less than $1.90 a day at 2011
    international prices. As a result of revisions in PPP exchange
    rates, poverty rates for individual countries cannot be compared
    with poverty rates reported in earlier editions.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, Development Research Group. Data
    are based on primary household survey data obtained from government
    statistical agencies and World Bank country departments. Data for
    high-income economies are from the Luxembourg Income Study database.
    For more information and methodology, please see PovcalNet
    (http://iresearch.worldbank.org/PovcalNet/index.htm"}"}).
 
 -------------------------------------------------------------------------
    
      
    Topics: Poverty
 
 -------------------------------------------------------------------------
      
    Topics: Aid Effectiveness
 
 -------------------------------------------------------------------------
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------





Metadata: ny.gdp.pcap.pp.kd

--------------------------------------------------------------------------
    
    Name: GDP per capita, PPP (constant 2011 international $)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: GDP per capita based on purchasing power parity
    (PPP"}). PPP GDP is gross domestic product converted to
    international dollars using purchasing power parity rates. An
    international dollar has the same purchasing power over GDP as the
    U.S. dollar has in the United States. GDP at purchaser's prices is
    the sum of gross value added by all resident producers in the
    economy plus any product taxes and minus any subsidies not included
    in the value of the products. It is calculated without making
    deductions for depreciation of fabricated assets or for depletion
    and degradation of natural resources. Data are in constant 2011
    international dollars.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, International Comparison Program
    database.
 
 -------------------------------------------------------------------------
    
      
    Topics: Economy & Growth
 
 -------------------------------------------------------------------------



. 
. 
. *** Other languages
. 
. wbopendata2, indicator(si.pov.dday; ny.gdp.pcap.pp.kd) clear long testse
> rver language(ar)



Metadata: si.pov.dday

--------------------------------------------------------------------------
    
    Name: Poverty headcount ratio at $1.90 a day (2011 PPP) (% of
    population)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Poverty headcount ratio at $1.90 a day is the
    percentage of the population living on less than $1.90 a day at 2011
    international prices. As a result of revisions in PPP exchange
    rates, poverty rates for individual countries cannot be compared
    with poverty rates reported in earlier editions.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, Development Research Group. Data
    are based on primary household survey data obtained from government
    statistical agencies and World Bank country departments. Data for
    high-income economies are from the Luxembourg Income Study database.
    For more information and methodology, please see PovcalNet
    (http://iresearch.worldbank.org/PovcalNet/index.htm"}"}).
 
 -------------------------------------------------------------------------
    
      
    Topics: Poverty
 
 -------------------------------------------------------------------------
      
    Topics: Aid Effectiveness
 
 -------------------------------------------------------------------------
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------





Metadata: ny.gdp.pcap.pp.kd

--------------------------------------------------------------------------
    
    Name: GDP per capita, PPP (constant 2011 international $)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: GDP per capita based on purchasing power parity
    (PPP"}). PPP GDP is gross domestic product converted to
    international dollars using purchasing power parity rates. An
    international dollar has the same purchasing power over GDP as the
    U.S. dollar has in the United States. GDP at purchaser's prices is
    the sum of gross value added by all resident producers in the
    economy plus any product taxes and minus any subsidies not included
    in the value of the products. It is calculated without making
    deductions for depreciation of fabricated assets or for depletion
    and degradation of natural resources. Data are in constant 2011
    international dollars.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, International Comparison Program
    database.
 
 -------------------------------------------------------------------------
    
      
    Topics: Economy & Growth
 
 -------------------------------------------------------------------------



. 
. wbopendata2, indicator(si.pov.dday; ny.gdp.pcap.pp.kd) clear long testse
> rver language(zh)



Metadata: si.pov.dday

--------------------------------------------------------------------------
    
    Name: Poverty headcount ratio at $1.90 a day (2011 PPP) (% of
    population)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Poverty headcount ratio at $1.90 a day is the
    percentage of the population living on less than $1.90 a day at 2011
    international prices. As a result of revisions in PPP exchange
    rates, poverty rates for individual countries cannot be compared
    with poverty rates reported in earlier editions.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, Development Research Group. Data
    are based on primary household survey data obtained from government
    statistical agencies and World Bank country departments. Data for
    high-income economies are from the Luxembourg Income Study database.
    For more information and methodology, please see PovcalNet
    (http://iresearch.worldbank.org/PovcalNet/index.htm"}"}).
 
 -------------------------------------------------------------------------
    
      
    Topics: Poverty
 
 -------------------------------------------------------------------------
      
    Topics: Aid Effectiveness
 
 -------------------------------------------------------------------------
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------





Metadata: ny.gdp.pcap.pp.kd

--------------------------------------------------------------------------
    
    Name: GDP per capita, PPP (constant 2011 international $)
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: GDP per capita based on purchasing power parity
    (PPP"}). PPP GDP is gross domestic product converted to
    international dollars using purchasing power parity rates. An
    international dollar has the same purchasing power over GDP as the
    U.S. dollar has in the United States. GDP at purchaser's prices is
    the sum of gross value added by all resident producers in the
    economy plus any product taxes and minus any subsidies not included
    in the value of the products. It is calculated without making
    deductions for depreciation of fabricated assets or for depletion
    and degradation of natural resources. Data are in constant 2011
    international dollars.
 
 -------------------------------------------------------------------------
    
    Source Organization: World Bank, International Comparison Program
    database.
 
 -------------------------------------------------------------------------
    
      
    Topics: Economy & Growth
 
 -------------------------------------------------------------------------



. 
. 
. *** Date Range (SP.POP.TOTL?date=2000:2001)
. 
. set trace off

. 
. wbopendata2, country(ago;bdi;chi;dnk;esp) indicator(SP.POP.TOTL) date(20
> 00:2010) clear 



Metadata: SP.POP.TOTL

--------------------------------------------------------------------------
    
    Name: Population, total
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Total population is based on the de facto definition of
    population, which counts all residents regardless of legal status or
    citizenship. The values shown are midyear estimates.
 
 -------------------------------------------------------------------------
    
    Source Organization: (1) United Nations Population Division. World
    Population Prospects: 2017 Revision. (2) Census reports and other
    statistical publications from national statistical offices, (3)
    Eurostat: Demographic Statistics, (4) United Nations Statistical
    Division. Population and Vital Statistics Reprot (various years),
    (5) U.S. Census Bureau: International Database, and (6) Secretariat
    of the Pacific Community: Statistics and Demography Programme.
 
 -------------------------------------------------------------------------
    
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------
      
    Topics: Health
 
 -------------------------------------------------------------------------



. tab countrycode

    Country |
       Code |      Freq.     Percent        Cum.
------------+-----------------------------------
        AGO |          1       20.00       20.00
        BDI |          1       20.00       40.00
        CHI |          1       20.00       60.00
        DNK |          1       20.00       80.00
        ESP |          1       20.00      100.00
------------+-----------------------------------
      Total |          5      100.00

. 
. wbopendata2, country(ago;bdi;chi;dnk;esp) indicator(SP.POP.TOTL) date(20
> 00:2010) clear testserver 



Metadata: SP.POP.TOTL

--------------------------------------------------------------------------
    
    Name: Population, total
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Total population is based on the de facto definition of
    population, which counts all residents regardless of legal status or
    citizenship. The values shown are midyear estimates.
 
 -------------------------------------------------------------------------
    
    Source Organization: (1) United Nations Population Division. World
    Population Prospects: 2017 Revision. (2) Census reports and other
    statistical publications from national statistical offices, (3)
    Eurostat: Demographic Statistics, (4) United Nations Statistical
    Division. Population and Vital Statistics Reprot (various years),
    (5) U.S. Census Bureau: International Database, and (6) Secretariat
    of the Pacific Community: Statistics and Demography Programme.
 
 -------------------------------------------------------------------------
    
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------
      
    Topics: Health
 
 -------------------------------------------------------------------------



. tab countrycode

    Country |
       Code |      Freq.     Percent        Cum.
------------+-----------------------------------
        AGO |          1       20.00       20.00
        BDI |          1       20.00       40.00
        CHI |          1       20.00       60.00
        DNK |          1       20.00       80.00
        ESP |          1       20.00      100.00
------------+-----------------------------------
      Total |          5      100.00

. 
. *********************************************************
. 
. wbopendata2, indicator(SP.POP.TOTL) date(2000:2010) clear 



Metadata: SP.POP.TOTL

--------------------------------------------------------------------------
    
    Name: Population, total
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Total population is based on the de facto definition of
    population, which counts all residents regardless of legal status or
    citizenship. The values shown are midyear estimates.
 
 -------------------------------------------------------------------------
    
    Source Organization: (1) United Nations Population Division. World
    Population Prospects: 2017 Revision. (2) Census reports and other
    statistical publications from national statistical offices, (3)
    Eurostat: Demographic Statistics, (4) United Nations Statistical
    Division. Population and Vital Statistics Reprot (various years),
    (5) U.S. Census Bureau: International Database, and (6) Secretariat
    of the Pacific Community: Statistics and Demography Programme.
 
 -------------------------------------------------------------------------
    
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------
      
    Topics: Health
 
 -------------------------------------------------------------------------



. tab countrycode

    Country |
       Code |      Freq.     Percent        Cum.
------------+-----------------------------------
        ABW |          1        0.38        0.38
        AFG |          1        0.38        0.76
        AGO |          1        0.38        1.14
        ALB |          1        0.38        1.52
        AND |          1        0.38        1.89
        ARB |          1        0.38        2.27
        ARE |          1        0.38        2.65
        ARG |          1        0.38        3.03
        ARM |          1        0.38        3.41
        ASM |          1        0.38        3.79
        ATG |          1        0.38        4.17
        AUS |          1        0.38        4.55
        AUT |          1        0.38        4.92
        AZE |          1        0.38        5.30
        BDI |          1        0.38        5.68
        BEL |          1        0.38        6.06
        BEN |          1        0.38        6.44
        BFA |          1        0.38        6.82
        BGD |          1        0.38        7.20
        BGR |          1        0.38        7.58
        BHR |          1        0.38        7.95
        BHS |          1        0.38        8.33
        BIH |          1        0.38        8.71
        BLR |          1        0.38        9.09
        BLZ |          1        0.38        9.47
        BMU |          1        0.38        9.85
        BOL |          1        0.38       10.23
        BRA |          1        0.38       10.61
        BRB |          1        0.38       10.98
        BRN |          1        0.38       11.36
        BTN |          1        0.38       11.74
        BWA |          1        0.38       12.12
        CAF |          1        0.38       12.50
        CAN |          1        0.38       12.88
        CEB |          1        0.38       13.26
        CHE |          1        0.38       13.64
        CHI |          1        0.38       14.02
        CHL |          1        0.38       14.39
        CHN |          1        0.38       14.77
        CIV |          1        0.38       15.15
        CMR |          1        0.38       15.53
        COD |          1        0.38       15.91
        COG |          1        0.38       16.29
        COL |          1        0.38       16.67
        COM |          1        0.38       17.05
        CPV |          1        0.38       17.42
        CRI |          1        0.38       17.80
        CSS |          1        0.38       18.18
        CUB |          1        0.38       18.56
        CUW |          1        0.38       18.94
        CYM |          1        0.38       19.32
        CYP |          1        0.38       19.70
        CZE |          1        0.38       20.08
        DEU |          1        0.38       20.45
        DJI |          1        0.38       20.83
        DMA |          1        0.38       21.21
        DNK |          1        0.38       21.59
        DOM |          1        0.38       21.97
        DZA |          1        0.38       22.35
        EAP |          1        0.38       22.73
        EAR |          1        0.38       23.11
        EAS |          1        0.38       23.48
        ECA |          1        0.38       23.86
        ECS |          1        0.38       24.24
        ECU |          1        0.38       24.62
        EGY |          1        0.38       25.00
        EMU |          1        0.38       25.38
        ERI |          1        0.38       25.76
        ESP |          1        0.38       26.14
        EST |          1        0.38       26.52
        ETH |          1        0.38       26.89
        EUU |          1        0.38       27.27
        FCS |          1        0.38       27.65
        FIN |          1        0.38       28.03
        FJI |          1        0.38       28.41
        FRA |          1        0.38       28.79
        FRO |          1        0.38       29.17
        FSM |          1        0.38       29.55
        GAB |          1        0.38       29.92
        GBR |          1        0.38       30.30
        GEO |          1        0.38       30.68
        GHA |          1        0.38       31.06
        GIB |          1        0.38       31.44
        GIN |          1        0.38       31.82
        GMB |          1        0.38       32.20
        GNB |          1        0.38       32.58
        GNQ |          1        0.38       32.95
        GRC |          1        0.38       33.33
        GRD |          1        0.38       33.71
        GRL |          1        0.38       34.09
        GTM |          1        0.38       34.47
        GUM |          1        0.38       34.85
        GUY |          1        0.38       35.23
        HIC |          1        0.38       35.61
        HKG |          1        0.38       35.98
        HND |          1        0.38       36.36
        HPC |          1        0.38       36.74
        HRV |          1        0.38       37.12
        HTI |          1        0.38       37.50
        HUN |          1        0.38       37.88
        IBD |          1        0.38       38.26
        IBT |          1        0.38       38.64
        IDA |          1        0.38       39.02
        IDB |          1        0.38       39.39
        IDN |          1        0.38       39.77
        IDX |          1        0.38       40.15
        IMN |          1        0.38       40.53
        IND |          1        0.38       40.91
        INX |          1        0.38       41.29
        IRL |          1        0.38       41.67
        IRN |          1        0.38       42.05
        IRQ |          1        0.38       42.42
        ISL |          1        0.38       42.80
        ISR |          1        0.38       43.18
        ITA |          1        0.38       43.56
        JAM |          1        0.38       43.94
        JOR |          1        0.38       44.32
        JPN |          1        0.38       44.70
        KAZ |          1        0.38       45.08
        KEN |          1        0.38       45.45
        KGZ |          1        0.38       45.83
        KHM |          1        0.38       46.21
        KIR |          1        0.38       46.59
        KNA |          1        0.38       46.97
        KOR |          1        0.38       47.35
        KWT |          1        0.38       47.73
        LAC |          1        0.38       48.11
        LAO |          1        0.38       48.48
        LBN |          1        0.38       48.86
        LBR |          1        0.38       49.24
        LBY |          1        0.38       49.62
        LCA |          1        0.38       50.00
        LCN |          1        0.38       50.38
        LDC |          1        0.38       50.76
        LIC |          1        0.38       51.14
        LIE |          1        0.38       51.52
        LKA |          1        0.38       51.89
        LMC |          1        0.38       52.27
        LMY |          1        0.38       52.65
        LSO |          1        0.38       53.03
        LTE |          1        0.38       53.41
        LTU |          1        0.38       53.79
        LUX |          1        0.38       54.17
        LVA |          1        0.38       54.55
        MAC |          1        0.38       54.92
        MAF |          1        0.38       55.30
        MAR |          1        0.38       55.68
        MCO |          1        0.38       56.06
        MDA |          1        0.38       56.44
        MDG |          1        0.38       56.82
        MDV |          1        0.38       57.20
        MEA |          1        0.38       57.58
        MEX |          1        0.38       57.95
        MHL |          1        0.38       58.33
        MIC |          1        0.38       58.71
        MKD |          1        0.38       59.09
        MLI |          1        0.38       59.47
        MLT |          1        0.38       59.85
        MMR |          1        0.38       60.23
        MNA |          1        0.38       60.61
        MNE |          1        0.38       60.98
        MNG |          1        0.38       61.36
        MNP |          1        0.38       61.74
        MOZ |          1        0.38       62.12
        MRT |          1        0.38       62.50
        MUS |          1        0.38       62.88
        MWI |          1        0.38       63.26
        MYS |          1        0.38       63.64
        NAC |          1        0.38       64.02
        NAM |          1        0.38       64.39
        NCL |          1        0.38       64.77
        NER |          1        0.38       65.15
        NGA |          1        0.38       65.53
        NIC |          1        0.38       65.91
        NLD |          1        0.38       66.29
        NOR |          1        0.38       66.67
        NPL |          1        0.38       67.05
        NRU |          1        0.38       67.42
        NZL |          1        0.38       67.80
        OED |          1        0.38       68.18
        OMN |          1        0.38       68.56
        OSS |          1        0.38       68.94
        PAK |          1        0.38       69.32
        PAN |          1        0.38       69.70
        PER |          1        0.38       70.08
        PHL |          1        0.38       70.45
        PLW |          1        0.38       70.83
        PNG |          1        0.38       71.21
        POL |          1        0.38       71.59
        PRE |          1        0.38       71.97
        PRI |          1        0.38       72.35
        PRK |          1        0.38       72.73
        PRT |          1        0.38       73.11
        PRY |          1        0.38       73.48
        PSE |          1        0.38       73.86
        PSS |          1        0.38       74.24
        PST |          1        0.38       74.62
        PYF |          1        0.38       75.00
        QAT |          1        0.38       75.38
        ROU |          1        0.38       75.76
        RUS |          1        0.38       76.14
        RWA |          1        0.38       76.52
        SAS |          1        0.38       76.89
        SAU |          1        0.38       77.27
        SDN |          1        0.38       77.65
        SEN |          1        0.38       78.03
        SGP |          1        0.38       78.41
        SLB |          1        0.38       78.79
        SLE |          1        0.38       79.17
        SLV |          1        0.38       79.55
        SMR |          1        0.38       79.92
        SOM |          1        0.38       80.30
        SRB |          1        0.38       80.68
        SSA |          1        0.38       81.06
        SSD |          1        0.38       81.44
        SSF |          1        0.38       81.82
        SST |          1        0.38       82.20
        STP |          1        0.38       82.58
        SUR |          1        0.38       82.95
        SVK |          1        0.38       83.33
        SVN |          1        0.38       83.71
        SWE |          1        0.38       84.09
        SWZ |          1        0.38       84.47
        SXM |          1        0.38       84.85
        SYC |          1        0.38       85.23
        SYR |          1        0.38       85.61
        TCA |          1        0.38       85.98
        TCD |          1        0.38       86.36
        TEA |          1        0.38       86.74
        TEC |          1        0.38       87.12
        TGO |          1        0.38       87.50
        THA |          1        0.38       87.88
        TJK |          1        0.38       88.26
        TKM |          1        0.38       88.64
        TLA |          1        0.38       89.02
        TLS |          1        0.38       89.39
        TMN |          1        0.38       89.77
        TON |          1        0.38       90.15
        TSA |          1        0.38       90.53
        TSS |          1        0.38       90.91
        TTO |          1        0.38       91.29
        TUN |          1        0.38       91.67
        TUR |          1        0.38       92.05
        TUV |          1        0.38       92.42
        TZA |          1        0.38       92.80
        UGA |          1        0.38       93.18
        UKR |          1        0.38       93.56
        UMC |          1        0.38       93.94
        URY |          1        0.38       94.32
        USA |          1        0.38       94.70
        UZB |          1        0.38       95.08
        VCT |          1        0.38       95.45
        VEN |          1        0.38       95.83
        VGB |          1        0.38       96.21
        VIR |          1        0.38       96.59
        VNM |          1        0.38       96.97
        VUT |          1        0.38       97.35
        WLD |          1        0.38       97.73
        WSM |          1        0.38       98.11
        XKX |          1        0.38       98.48
        YEM |          1        0.38       98.86
        ZAF |          1        0.38       99.24
        ZMB |          1        0.38       99.62
        ZWE |          1        0.38      100.00
------------+-----------------------------------
      Total |        264      100.00

. 
. wbopendata2, indicator(SP.POP.TOTL) date(2000:2010) clear testserver 



Metadata: SP.POP.TOTL

--------------------------------------------------------------------------
    
    Name: Population, total
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Total population is based on the de facto definition of
    population, which counts all residents regardless of legal status or
    citizenship. The values shown are midyear estimates.
 
 -------------------------------------------------------------------------
    
    Source Organization: (1) United Nations Population Division. World
    Population Prospects: 2017 Revision. (2) Census reports and other
    statistical publications from national statistical offices, (3)
    Eurostat: Demographic Statistics, (4) United Nations Statistical
    Division. Population and Vital Statistics Reprot (various years),
    (5) U.S. Census Bureau: International Database, and (6) Secretariat
    of the Pacific Community: Statistics and Demography Programme.
 
 -------------------------------------------------------------------------
    
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------
      
    Topics: Health
 
 -------------------------------------------------------------------------



. tab countrycode

    Country |
       Code |      Freq.     Percent        Cum.
------------+-----------------------------------
        ABW |          1        0.38        0.38
        AFG |          1        0.38        0.76
        AGO |          1        0.38        1.14
        ALB |          1        0.38        1.52
        AND |          1        0.38        1.89
        ARB |          1        0.38        2.27
        ARE |          1        0.38        2.65
        ARG |          1        0.38        3.03
        ARM |          1        0.38        3.41
        ASM |          1        0.38        3.79
        ATG |          1        0.38        4.17
        AUS |          1        0.38        4.55
        AUT |          1        0.38        4.92
        AZE |          1        0.38        5.30
        BDI |          1        0.38        5.68
        BEL |          1        0.38        6.06
        BEN |          1        0.38        6.44
        BFA |          1        0.38        6.82
        BGD |          1        0.38        7.20
        BGR |          1        0.38        7.58
        BHR |          1        0.38        7.95
        BHS |          1        0.38        8.33
        BIH |          1        0.38        8.71
        BLR |          1        0.38        9.09
        BLZ |          1        0.38        9.47
        BMU |          1        0.38        9.85
        BOL |          1        0.38       10.23
        BRA |          1        0.38       10.61
        BRB |          1        0.38       10.98
        BRN |          1        0.38       11.36
        BTN |          1        0.38       11.74
        BWA |          1        0.38       12.12
        CAF |          1        0.38       12.50
        CAN |          1        0.38       12.88
        CEB |          1        0.38       13.26
        CHE |          1        0.38       13.64
        CHI |          1        0.38       14.02
        CHL |          1        0.38       14.39
        CHN |          1        0.38       14.77
        CIV |          1        0.38       15.15
        CMR |          1        0.38       15.53
        COD |          1        0.38       15.91
        COG |          1        0.38       16.29
        COL |          1        0.38       16.67
        COM |          1        0.38       17.05
        CPV |          1        0.38       17.42
        CRI |          1        0.38       17.80
        CSS |          1        0.38       18.18
        CUB |          1        0.38       18.56
        CUW |          1        0.38       18.94
        CYM |          1        0.38       19.32
        CYP |          1        0.38       19.70
        CZE |          1        0.38       20.08
        DEU |          1        0.38       20.45
        DJI |          1        0.38       20.83
        DMA |          1        0.38       21.21
        DNK |          1        0.38       21.59
        DOM |          1        0.38       21.97
        DZA |          1        0.38       22.35
        EAP |          1        0.38       22.73
        EAR |          1        0.38       23.11
        EAS |          1        0.38       23.48
        ECA |          1        0.38       23.86
        ECS |          1        0.38       24.24
        ECU |          1        0.38       24.62
        EGY |          1        0.38       25.00
        EMU |          1        0.38       25.38
        ERI |          1        0.38       25.76
        ESP |          1        0.38       26.14
        EST |          1        0.38       26.52
        ETH |          1        0.38       26.89
        EUU |          1        0.38       27.27
        FCS |          1        0.38       27.65
        FIN |          1        0.38       28.03
        FJI |          1        0.38       28.41
        FRA |          1        0.38       28.79
        FRO |          1        0.38       29.17
        FSM |          1        0.38       29.55
        GAB |          1        0.38       29.92
        GBR |          1        0.38       30.30
        GEO |          1        0.38       30.68
        GHA |          1        0.38       31.06
        GIB |          1        0.38       31.44
        GIN |          1        0.38       31.82
        GMB |          1        0.38       32.20
        GNB |          1        0.38       32.58
        GNQ |          1        0.38       32.95
        GRC |          1        0.38       33.33
        GRD |          1        0.38       33.71
        GRL |          1        0.38       34.09
        GTM |          1        0.38       34.47
        GUM |          1        0.38       34.85
        GUY |          1        0.38       35.23
        HIC |          1        0.38       35.61
        HKG |          1        0.38       35.98
        HND |          1        0.38       36.36
        HPC |          1        0.38       36.74
        HRV |          1        0.38       37.12
        HTI |          1        0.38       37.50
        HUN |          1        0.38       37.88
        IBD |          1        0.38       38.26
        IBT |          1        0.38       38.64
        IDA |          1        0.38       39.02
        IDB |          1        0.38       39.39
        IDN |          1        0.38       39.77
        IDX |          1        0.38       40.15
        IMN |          1        0.38       40.53
        IND |          1        0.38       40.91
        INX |          1        0.38       41.29
        IRL |          1        0.38       41.67
        IRN |          1        0.38       42.05
        IRQ |          1        0.38       42.42
        ISL |          1        0.38       42.80
        ISR |          1        0.38       43.18
        ITA |          1        0.38       43.56
        JAM |          1        0.38       43.94
        JOR |          1        0.38       44.32
        JPN |          1        0.38       44.70
        KAZ |          1        0.38       45.08
        KEN |          1        0.38       45.45
        KGZ |          1        0.38       45.83
        KHM |          1        0.38       46.21
        KIR |          1        0.38       46.59
        KNA |          1        0.38       46.97
        KOR |          1        0.38       47.35
        KWT |          1        0.38       47.73
        LAC |          1        0.38       48.11
        LAO |          1        0.38       48.48
        LBN |          1        0.38       48.86
        LBR |          1        0.38       49.24
        LBY |          1        0.38       49.62
        LCA |          1        0.38       50.00
        LCN |          1        0.38       50.38
        LDC |          1        0.38       50.76
        LIC |          1        0.38       51.14
        LIE |          1        0.38       51.52
        LKA |          1        0.38       51.89
        LMC |          1        0.38       52.27
        LMY |          1        0.38       52.65
        LSO |          1        0.38       53.03
        LTE |          1        0.38       53.41
        LTU |          1        0.38       53.79
        LUX |          1        0.38       54.17
        LVA |          1        0.38       54.55
        MAC |          1        0.38       54.92
        MAF |          1        0.38       55.30
        MAR |          1        0.38       55.68
        MCO |          1        0.38       56.06
        MDA |          1        0.38       56.44
        MDG |          1        0.38       56.82
        MDV |          1        0.38       57.20
        MEA |          1        0.38       57.58
        MEX |          1        0.38       57.95
        MHL |          1        0.38       58.33
        MIC |          1        0.38       58.71
        MKD |          1        0.38       59.09
        MLI |          1        0.38       59.47
        MLT |          1        0.38       59.85
        MMR |          1        0.38       60.23
        MNA |          1        0.38       60.61
        MNE |          1        0.38       60.98
        MNG |          1        0.38       61.36
        MNP |          1        0.38       61.74
        MOZ |          1        0.38       62.12
        MRT |          1        0.38       62.50
        MUS |          1        0.38       62.88
        MWI |          1        0.38       63.26
        MYS |          1        0.38       63.64
        NAC |          1        0.38       64.02
        NAM |          1        0.38       64.39
        NCL |          1        0.38       64.77
        NER |          1        0.38       65.15
        NGA |          1        0.38       65.53
        NIC |          1        0.38       65.91
        NLD |          1        0.38       66.29
        NOR |          1        0.38       66.67
        NPL |          1        0.38       67.05
        NRU |          1        0.38       67.42
        NZL |          1        0.38       67.80
        OED |          1        0.38       68.18
        OMN |          1        0.38       68.56
        OSS |          1        0.38       68.94
        PAK |          1        0.38       69.32
        PAN |          1        0.38       69.70
        PER |          1        0.38       70.08
        PHL |          1        0.38       70.45
        PLW |          1        0.38       70.83
        PNG |          1        0.38       71.21
        POL |          1        0.38       71.59
        PRE |          1        0.38       71.97
        PRI |          1        0.38       72.35
        PRK |          1        0.38       72.73
        PRT |          1        0.38       73.11
        PRY |          1        0.38       73.48
        PSE |          1        0.38       73.86
        PSS |          1        0.38       74.24
        PST |          1        0.38       74.62
        PYF |          1        0.38       75.00
        QAT |          1        0.38       75.38
        ROU |          1        0.38       75.76
        RUS |          1        0.38       76.14
        RWA |          1        0.38       76.52
        SAS |          1        0.38       76.89
        SAU |          1        0.38       77.27
        SDN |          1        0.38       77.65
        SEN |          1        0.38       78.03
        SGP |          1        0.38       78.41
        SLB |          1        0.38       78.79
        SLE |          1        0.38       79.17
        SLV |          1        0.38       79.55
        SMR |          1        0.38       79.92
        SOM |          1        0.38       80.30
        SRB |          1        0.38       80.68
        SSA |          1        0.38       81.06
        SSD |          1        0.38       81.44
        SSF |          1        0.38       81.82
        SST |          1        0.38       82.20
        STP |          1        0.38       82.58
        SUR |          1        0.38       82.95
        SVK |          1        0.38       83.33
        SVN |          1        0.38       83.71
        SWE |          1        0.38       84.09
        SWZ |          1        0.38       84.47
        SXM |          1        0.38       84.85
        SYC |          1        0.38       85.23
        SYR |          1        0.38       85.61
        TCA |          1        0.38       85.98
        TCD |          1        0.38       86.36
        TEA |          1        0.38       86.74
        TEC |          1        0.38       87.12
        TGO |          1        0.38       87.50
        THA |          1        0.38       87.88
        TJK |          1        0.38       88.26
        TKM |          1        0.38       88.64
        TLA |          1        0.38       89.02
        TLS |          1        0.38       89.39
        TMN |          1        0.38       89.77
        TON |          1        0.38       90.15
        TSA |          1        0.38       90.53
        TSS |          1        0.38       90.91
        TTO |          1        0.38       91.29
        TUN |          1        0.38       91.67
        TUR |          1        0.38       92.05
        TUV |          1        0.38       92.42
        TZA |          1        0.38       92.80
        UGA |          1        0.38       93.18
        UKR |          1        0.38       93.56
        UMC |          1        0.38       93.94
        URY |          1        0.38       94.32
        USA |          1        0.38       94.70
        UZB |          1        0.38       95.08
        VCT |          1        0.38       95.45
        VEN |          1        0.38       95.83
        VGB |          1        0.38       96.21
        VIR |          1        0.38       96.59
        VNM |          1        0.38       96.97
        VUT |          1        0.38       97.35
        WLD |          1        0.38       97.73
        WSM |          1        0.38       98.11
        XKX |          1        0.38       98.48
        YEM |          1        0.38       98.86
        ZAF |          1        0.38       99.24
        ZMB |          1        0.38       99.62
        ZWE |          1        0.38      100.00
------------+-----------------------------------
      Total |        264      100.00

. 
. 
. wbopendata2, indicator(SP.POP.TOTL; SP.POP.0713.TO.UN ; SP.POP.1317.TO.U
> N ) clear long 



Metadata: SP.POP.TOTL

--------------------------------------------------------------------------
    
    Name: Population, total
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: World Development Indicators
 
 -------------------------------------------------------------------------
    
    Source Note: Total population is based on the de facto definition of
    population, which counts all residents regardless of legal status or
    citizenship. The values shown are midyear estimates.
 
 -------------------------------------------------------------------------
    
    Source Organization: (1) United Nations Population Division. World
    Population Prospects: 2017 Revision. (2) Census reports and other
    statistical publications from national statistical offices, (3)
    Eurostat: Demographic Statistics, (4) United Nations Statistical
    Division. Population and Vital Statistics Reprot (various years),
    (5) U.S. Census Bureau: International Database, and (6) Secretariat
    of the Pacific Community: Statistics and Demography Programme.
 
 -------------------------------------------------------------------------
    
      
    Topics: Climate Change
 
 -------------------------------------------------------------------------
      
    Topics: Health
 
 -------------------------------------------------------------------------





Metadata: SP.POP.0713.TO.UN

--------------------------------------------------------------------------
    
    Name: Population, ages 7-13, total
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: Education Statistics
 
 -------------------------------------------------------------------------
    
    Source Note: Population, ages 7-13, total is the total population
    age 7-13.
 
 -------------------------------------------------------------------------
    
    Source Organization: UNESCO Institute for Statistics (Derived)
 
 -------------------------------------------------------------------------
    
      
    Topics: Education
 
 -------------------------------------------------------------------------





Metadata: SP.POP.1317.TO.UN

--------------------------------------------------------------------------
    
    Name: Population, ages 13-17, total
 
  ------------------------------------------------------------------------
    <wb:unit />
    
    Source: Education Statistics
 
 -------------------------------------------------------------------------
    
    Source Note: Population, ages 13-17, total is the total population
    age 13-17.
 
 -------------------------------------------------------------------------
    
    Source Organization: UNESCO Institute for Statistics (Derived)
 
 -------------------------------------------------------------------------
    
      
    Topics: Education
 
 -------------------------------------------------------------------------



. keep if year == 2015
(19,536 observations deleted)

. sum if year == 2015

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 countryname |          0
 countrycode |          0
    iso2code |          0
      region |          0
  regioncode |          0
-------------+---------------------------------------------------------
        year |        264        2015           0       2015       2015
 sp_pop_totl |        262    2.96e+08    9.36e+08      11001   7.36e+09
sp_pop_071~n |        181     4764663    1.62e+07      10124   1.74e+08
sp_pop_131~n |        181     3329831    1.18e+07       7372   1.23e+08

. browse if year == 2015

. gen sp_pop_0717_to_un  = sp_pop_0713_to_un+ sp_pop_1317_to_un
(83 missing values generated)

. 
end of do-file
      name:  __000000
       log:  C:\Users\wb255520\Documents\myados\wbopendata\run\wbopendata_
> v14_test.log
  log type:  text
 closed on:   8 Jan 2019, 22:43:56
--------------------------------------------------------------------------
